     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
     A          K EMPNUM
     A          S WORKSHIFT                 COMP(EQ '1') 
