

         Dcl-Pr DayOfWeek ZONED(1) ;
           WorkDate  Date;
         End-Pr;

         Dcl-Pr DayName Char(9);
           DateIn Date;
         End-Pr;

         Dcl-Pr DateWords Char(28);
           WorkDate  Date;
         End-Pr;

         Dcl-Pr FindDay  Char(2);
           WorkDate  Date;
         End-Pr;

         Dcl-Pr MonthNumName Char(9);
            DayIn Date;
          END-PR;

         Dcl-Pr FindYear Char(4);
           DateIn Date;
         END-PR;
 
