             PGM

             CRTRPGMOD  MODULE(DM433D09/DATEPROCS) SRCFILE(DM433D09/LAB11) SRCMBR(DATEPROCS)
             CRTRPGMOD  MODULE(DM433D09/WHATDAYRPG) SRCFILE(DM433D09/LAB11) SRCMBR(WHATDAYRPG)

             CRTPGM     PGM(DM433D09/WHATDAY) MODULE(DM433D09/WHATDAYRPG DM433D09/DATEPROCS)

             CALL       WHATDAY

             ENDPGM 
