     A          R AMERICANLG                PFILE(BASEBALL20/AMERICANLG)
     A          K LNAME
     A          S TEAM                      COMP(EQ 3) 
