             PGM

             ADDLIBLE   BASEBALL20
             MONMSG     MSGID(CPF2103)

             OVRDBF     AMERICANLG JAYS

             CALL       CRTJAYRPRT

             ENDPGM 
